# Напишите пример любого класса и создайте его объект
class A:
    def d(self):
        print("Good Day")
    def f(self):
        print("Good Morning")

object_a = A()
object_a.d()

object_f = A()
object_f.f()

